<?php

namespace App\Utils;

class FormUtil
{
    public static function getDobDays(): array
    {
        $day = [];
        for ($i = 1; $i <= 31; $i++) {
            $day[] = str_pad($i, 2, '0', STR_PAD_LEFT);
        }
        return $day;
    }

    public static function getDobMonths(): array
    {
        return [
            '01' => 'ມັງກອນ',
            '02' => 'ກຸມພາ',
            '03' => 'ມີນາ',
            '04' => 'ເມສາ',
            '05' => 'ພຶດສະພາ',
            '06' => 'ມິຖຸນາ',
            '07' => 'ກໍລະກົດ',
            '08' => 'ສິງຫາ',
            '09' => 'ກັນຍາ',
            '10' => 'ຕຸລາ',
            '11' => 'ພະຈິກ',
            '12' => 'ທັນວາ',
        ];
    }

    public static function getDobYears(): array
    {
        $years = [];
        for ($i = 2015; $i >= 1930; $i--) {
            $years[] = (string) $i;
        }
        return $years;
    }

    public static function getGenders(): array
    {
        return [
            'M' => 'ຊາຍ',
            'F' => 'ຍິງ',
            'L' => 'LGBTQIA+',
        ];
    }

    public static function getProvinces(): array
    {
        return [['id' => 'VT', 'name' => 'ນະຄອນຫຼວງວຽງຈັນ', 'districts' => ['ຈັນທະບູລີ', 'ສີໂຄດຕະບອງ', 'ໄຊເສດຖາ', 'ສີສັດຕະນາກ', 'ນາຊາຍທອງ', 'ໄຊທານີ', 'ຫາດຊາຍຟອງ', 'ສັງທອງ', 'ປາກງື່ມ']], ['id' => 'AT', 'name' => 'ອັດຕະປື', 'districts' => ['ໄຊເສດຖາ', 'ສາມັກຄີໄຊ', 'ສະໜາມໄຊ', 'ຊານໄຊ', 'ພູວົງ']], ['id' => 'BK', 'name' => 'ບໍ່ແກ້ວ', 'districts' => ['ຫ້ວຍຊາຍ', 'ຕົ້ນເຜິ້ງ', 'ເມິງ', 'ຜາອຸດົມ', 'ປາກທາ']], ['id' => 'BL', 'name' => 'ບໍລິຄໍາໄຊ', 'districts' => ['ປາກຊັນ', 'ທ່າພະບາດ', 'ປາກກະດິງ', 'ບໍລິຄັນ', 'ຄຳເກີດ', 'ວຽງທອງ', 'ໄຊຈຳພອນ']], ['id' => 'CH', 'name' => 'ຈໍາປາສັກ', 'districts' => ['ປາກເຊ', 'ຊະນະສົມບູນ', 'ບາຈຽງຈະເລີນສຸກ', 'ປາກຊ່ອງ', 'ປະທຸມພອນ', 'ໂພນທອງ', 'ຈຳປາສັກ', 'ສຸຂຸມາ', 'ມຸນລະປະໂມກ', 'ໂຂງ']], ['id' => 'HO', 'name' => 'ຫົວພັນ', 'districts' => ['ຊຳເໜືອ', 'ຊຽງຄໍ້', 'ຮ້ຽມ', 'ວຽງໄຊ', 'ຫົວເມືອງ', 'ຊຳໃຕ້', 'ສົບເບົາ', 'ແອດ', 'ກວັນ', 'ຊອນ']], ['id' => 'KH', 'name' => 'ຄໍາມ່ວນ', 'districts' => ['ທ່າແຂກ', 'ມະຫາໄຊ', 'ໜອງບົກ', 'ຫີນບູນ', 'ຍົມມະລາດ', 'ບົວລະພາ', 'ນາກາຍ', 'ເຊບັ້ງໄຟ', 'ໄຊບົວທອງ', 'ຄູນຄຳ']], ['id' => 'LM', 'name' => 'ຫຼວງນ້ຳທາ', 'districts' => ['ຫຼວງນ້ຳທາ', 'ສິງ', 'ລອງ', 'ວຽງພູຄາ', 'ນາແລ']], ['id' => 'LP', 'name' => 'ຫຼວງພະບາງ', 'districts' => ['ນະຄອນຫຼວງພະບາງ', 'ຊຽງເງິນ', 'ນານ', 'ປາກອູ', 'ນ້ຳບາກ', 'ງອຍ', 'ປາກແຊງ', 'ໂພນໄຊ', 'ຈອມເພັດ', 'ວຽງຄຳ', 'ພູຄູນ', 'ໂພນທອງ']], ['id' => 'OU', 'name' => 'ອຸດົມໄຊ', 'districts' => ['ໄຊ', 'ຫລາ', 'ນາໝໍ້', 'ງາ', 'ແບງ', 'ຮຸນ', 'ປາກແບງ']], ['id' => 'PH', 'name' => 'ຜົ້ງສາລີ', 'districts' => ['ຜົ້ງສາລີ', 'ໃຫມ່', 'ຂວາ', 'ສຳພັນ', 'ບູນເຫນືອ', 'ຍອດອູ', 'ບູນໃຕ້']], ['id' => 'SL', 'name' => 'ສາລະວັນ', 'districts' => ['ສາລະວັນ', 'ຕາໂອ້ຍ', 'ຕຸ້ມລານ', 'ລະຄອນເພັງ', 'ວາປີ', 'ຄົງເຊໂດນ', 'ເລົ່າງາມ', 'ສະມ້ວຍ']], ['id' => 'SV', 'name' => 'ສະຫວັນນະເຂດ', 'districts' => ['ໄກສອນ ພົມວິຫານ', 'ອຸທຸມພອນ', 'ອາດສະພັງທອງ', 'ພິນ', 'ເຊໂປນ', 'ນອງ', 'ທ່າປາງທອງ', 'ສອງຄອນ', 'ຈຳພອນ', 'ຊົນບູລີ', 'ໄຊບູລີ', 'ວິລະບູລີ', 'ອາດສະພອນ', 'ໄຊພູທອງ', 'ພະລານໄຊ', 'ຄັນທະບູລີ']], ['id' => 'VI', 'name' => 'ວຽງຈັນ', 'districts' => ['ໂພນໂຮງ', 'ທຸລະຄົມ', 'ແກ້ວອຸດົມ', 'ກາສີ', 'ວັງວຽງ', 'ເຟືອງ', 'ຊະນະຄາມ', 'ແມດ', 'ວຽງຄຳ', 'ຫີນເຫີບ', 'ໝື່ນ']], ['id' => 'XA', 'name' => 'ໄຊຍະບູລີ', 'districts' => ['ໄຊຍະບູລີ', 'ຄອບ', 'ຫົງສາ', 'ເງິນ', 'ຊຽງຮ່ອນ', 'ພຽງ', 'ປາກລາຍ', 'ແກ່ນທ້າວ', 'ບໍ່ແຕນ', 'ທົ່ງມີໄຊ', 'ໄຊຊະຖານ']], ['id' => 'XS', 'name' => 'ໄຊສົມບູນ', 'districts' => ['ອານຸວົງ', 'ທ່າໂທມ', 'ລ້ອງແຈ້ງ', 'ຮົ່ມ', 'ລ້ອງຊານ']], ['id' => 'XE', 'name' => 'ເຊກອງ', 'districts' => ['ລະມານ', 'ກະລືມ', 'ດາກຈຶງ', 'ທ່າແຕງ']], ['id' => 'XI', 'name' => 'ຊຽງຂວາງ', 'districts' => ['ແປກ', 'ຄຳ', 'ໜອງແຮດ', 'ຄູນ', 'ໝອກ', 'ພູກູດ', 'ຜາໄຊ']]];
    }

    public static function getProvinceName(string $provinceId): string
    {
        $provinces = collect(self::getProvinces());
        $province = $provinces->firstWhere('id', $provinceId);
        return $province !== null ? $province['name'] : '';
    }

    public static function getDistricts($provinceId): array
    {
        $provinces = collect(self::getProvinces());
        $province = $provinces->firstWhere('id', $provinceId);
        return $province !== null ? $province['districts'] : [];
    }
}
