<div class="rounded-xl bg-white p-8 space-y-4">

  <div class="mx-auto w-max">
    <svg xmlns="http://www.w3.org/2000/svg" width="150" height="150" viewBox="0 0 150 150">
      <path id="Icon_fa-solid-circle-info" data-name="Icon fa-solid-circle-info" d="M75,150A75,75,0,1,0,0,75,75,75,0,0,0,75,150ZM63.281,98.438h7.031V79.688H63.281a7.031,7.031,0,0,1,0-14.062H77.344a7.014,7.014,0,0,1,7.031,7.031V98.438h2.344a7.031,7.031,0,1,1,0,14.062H63.281a7.031,7.031,0,1,1,0-14.062ZM75,37.5a9.375,9.375,0,1,1-9.375,9.375A9.375,9.375,0,0,1,75,37.5Z" fill="#488bc5"/>
    </svg>
  </div>

  <div class="bg-white p-4 text-center space-y-4">
    <div class="space-y-2">
      <div class="text-xl text-[#3D3D3D] font-bold">ຕອນນີ້ລະບົບຮອງຮັບການຊື້ສິນຄ້າສະເພາະ</div>
      <ul class="text-left list-disc ml-6">
        <li>ນະຄອນຫຼວງວຽງຈັນ (ເມືອງ: ຈັນທະບູລີ, ໄຊເສດຖາ, ສີສັດຕະນາກ, ໄຊທານີ, ສີໂຄດຕະບອງ)</li>
        <li>ເເຂວງຫຼວງພະບາງ (ນະຄອນຫຼວງພະບາງ)</li>
        <li>ເເຂວງວຽງຈັນ (ເມືອງ: ວັງວຽງ)</li>
        <li>ເເຂວງສະຫວັນນະເຂດ (ເມືອງ: ໄກສອນ ພົມວິຫານ, ພິນ, ເຊໂປນ)</li>
        <li>ແຂວງຄຳມ່ວນ: (ເມືອງ: ທ່າແຂກ)</li>
        <li>ແຂວງຈຳປາສັກ (ເມືອງ: ປາກເຊ, ບາຈຽງຈະເລີນສຸກ, ໂພນທອງ, ສະນະສົມບູນ, ໂຂງ)</li>
        <li>ແຂວງບໍລິຄຳໄຊ (ເມືອງ: ປາກຊັນ)</li>
        <li>ແຂວງສາລະວັນ (ເມືອງ: ສາລະວັນ)</li>
        <li>ແຂວງອັດຕະປື (ເມືອງ: ສາມັກຄີໄຊ, ໄຊເສດຖາ)</li>
        <li>ແຂວງອຸດົມໄຊ (ເມືອງ: ໄຊ)</li>
        <li>ແຂວງໄຊຍະບູລີ (ເມືອງ: ໄຊຍະບູລີ, ປາກລາຍ, ເງິນ, ຫົງສາ)</li>
        <li>ແຂວງບໍ່ເເກ້ວ (ເມືອງ: ຫ້ວຍຊາຍ, ຕົ້ນເຜິ້ງ)</li>
        <li>ແຂວງຊຽງຂວາງ (ເມືອງ: ແປກ, ຄູນ, ພູກູດ, ຄຳ)</li>
        <li>ແຂວງຫົວພັນ (ເມືອງ: ຊຳເໜືອ)</li>
        <li>ແຂວງຫຼວງນ້າທາ (ເມືອງ: ຫຼວງນ້າທາ)</li>
        <li>ແຂວງເຊກອງ (ເມືອງ: ລະມານ, ທ່າແຕງ)</li>
      </ul>
    </div>
  </div>

  <button type="button" class="btn btn-primary block mx-auto w-10/12 !mt-8" tabindex="-1" wire:click="$dispatch('closeModal')">ປິດ</button>

</div>
